In [6]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

Создадим таблицу с вариантом

In [7]:
y1 = 1
y2 = 0.4
y3 = 0.1
y4 = 0.01

In [8]:
def one(y1):
    return 225+22*y1

def two(y2):
    return 200+45*y2

def three(y3):
    return 183+450*y3

def four(y4):
    return 168+1000*y4

def five(y5):
    return 153 + 5200 * y5

In [9]:
strategy = [i for i in range(1,6)]
y1 = [one(y1),two(y1),three(y1),four(y1), five(y1)]
y2 = [one(y2),two(y2),three(y2),four(y2), five(y2)]
y3 = [one(y3),two(y3),three(y3),four(y3), five(y3)]
y4 = [one(y4),two(y4),three(y4),four(y4), five(y4)]

df = pd.DataFrame({

    "Cтратегия": strategy,
    "y1": y1,
    "y2":y2,
    "y3":y3,
    "y4":y4
})

df

   Cтратегия    y1      y2     y3      y4
0          1   247   233.8  227.2  225.22
1          2   245   218.0  204.5  200.45
2          3   633   363.0  228.0  187.50
3          4  1168   568.0  268.0  178.00
4          5  5353  2233.0  673.0  205.00

Подберем оптимальный вариант по критерию Лапласса

In [15]:
laplass_1 = df[['y1','y2','y3','y4']]*[0.2,0.2,0.3,0.3]
laplass_1

       y1      y2      y3      y4
0    49.4   46.76   68.16  67.566
1    49.0   43.60   61.35  60.135
2   126.6   72.60   68.40  56.250
3   233.6  113.60   80.40  53.400
4  1070.6  446.60  201.90  61.500

In [16]:
laplass_1.sum(axis = 1)

0     231.886
1     214.085
2     323.850
3     481.000
4    1780.600
dtype: float64

##### Согласно концепции Лапласса, нужно брать, то что больше, значит берем вариант 5

In [17]:
laplass_2 = df[['y1','y2','y3','y4']]*[0.25,0.25,0.25,0.25]
laplass_2

        y1      y2       y3       y4
0    61.75   58.45   56.800  56.3050
1    61.25   54.50   51.125  50.1125
2   158.25   90.75   57.000  46.8750
3   292.00  142.00   67.000  44.5000
4  1338.25  558.25  168.250  51.2500

In [19]:
laplass_2.sum(axis = 1)

0     233.3050
1     216.9875
2     352.8750
3     545.5000
4    2116.0000
dtype: float64

Согласно концепции Лапласса, нужно брать, то что больше, значит берем вариант 5

# Теперь реализуем алгоритм Гурвица

In [21]:
a = [0.1 * i for i in range(11)]
H = [max(a[i]*df[['y1','y2','y3','y4']].min(axis=1) + (1-a[i])*df[['y1','y2','y3','y4']].max(axis=1)) for i in range(len(a))]
H

[5353.0,
 4838.2,
 4323.400000000001,
 3808.6,
 3293.7999999999997,
 2779.0,
 2264.1999999999994,
 1749.3999999999996,
 1234.5999999999997,
 719.7999999999998,
 225.22]

In [22]:
[(a[i]*df[['y1','y2','y3','y4']].min(axis=1) + (1-a[i])*df[['y1','y2','y3','y4']].max(axis=1)).argmax()+1 for i in range(len(a))]

[5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 1]

In [24]:
df_1 = pd.DataFrame({
    "a":a,
    "Значение H" :H,
    "Номер выгодной стратегии":[(a[i]*df[['y1','y2','y3','y4']].min(axis=1) + (1-a[i])*df[['y1','y2','y3','y4']].max(axis=1)).argmax()+1 for i in range(len(a))]
})
df_1

      a  Значение H  Номер выгодной стратегии
0   0.0     5353.00                         5
1   0.1     4838.20                         5
2   0.2     4323.40                         5
3   0.3     3808.60                         5
4   0.4     3293.80                         5
5   0.5     2779.00                         5
6   0.6     2264.20                         5
7   0.7     1749.40                         5
8   0.8     1234.60                         5
9   0.9      719.80                         5
10  1.0      225.22                         1

Согласно Гурвицу берем вариант 1

# Реализуем выбор по Сэвиджу
Создадим матрицу рисков

In [38]:
matrix_1  = (10000 - df[['y1','y2','y3','y4']])

In [40]:
matrix_1

     y1      y2      y3       y4
0  9753  9766.2  9772.8  9774.78
1  9755  9782.0  9795.5  9799.55
2  9367  9637.0  9772.0  9812.50
3  8832  9432.0  9732.0  9822.00
4  4647  7767.0  9327.0  9795.00

In [48]:
matrix_1.max(axis=1).values

array([9774.78, 9799.55, 9812.5 , 9822.  , 9795.  ])

In [58]:
result = []
for i in range(len(matrix_1.max(axis=1).values)):
    result.append(abs(sum((matrix_1.iloc[i]-matrix_1.max(axis=1).values[i]).values * [0.2,0.2,0.3,0.3])))
result

[6.6660000000005315,
 13.63499999999949,
 136.35000000000002,
 303.0,
 1575.6000000000004]

In [59]:
min(result)

6.6660000000005315

что соответствует 1 варианту

In [60]:
result = []
for i in range(len(matrix_1.max(axis=1).values)):
    result.append(abs(sum((matrix_1.iloc[i]-matrix_1.max(axis=1).values[i]).values * [0.25,0.25,0.25,0.25])))
result

[8.085000000000491, 16.537499999999454, 165.375, 367.5, 1911.0]

In [61]:
min(result)

8.085000000000491

что соответствует 1 варианту

# Реализуем алгоритм Вальда

In [36]:
vald = df[['y1','y2','y3','y4']].min(axis=1)
vald

0    225.22
1    200.45
2    187.50
3    178.00
4    205.00
dtype: float64

In [37]:
vald.argmax()+1

1

По критерию Вальда проходит 1 вариант

В ходе работы было выяснено, что первый вариант является оптимальным, так как 3 из 4 метода указали на него